src/Catalogs/ЗД_ИнформационныеБазы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ЗД_ИнформационныеБазы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛогинБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортКластера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПортАгентаСервера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>4</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРазрешения</Name>
					<Comment>При установленной блокировки в 1Сv8*</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогВременныхФайлов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОжиданияОтключения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКПлатформе1С</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПерезапускКластера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отладка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтрокаПодключенияБазы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПутьКRAC</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеглЗаданияАктивность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SQL_db</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.SQLDBРабочие</v8:Type>
						<v8:Type>cfg:CatalogRef.SQLDBТестовые</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПолучателиУведомлений</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Получатель</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлять</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Сценарий</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Скрипт</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Скрипты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отметка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Хранилище</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Хранилище</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗД_Хранилища</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛогинХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПарольХранилища</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>30</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЗД_ИнформационныеБазы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если Не ЗначениеЗаполнено(Объект.ПутьКПлатформе1С) Тогда
	//	Объект.ПутьКПлатформе1С = КаталогПрограммы()+"1cv8.exe";	
	//КонецЕсли;     
	//
	//Если Не ЗначениеЗаполнено(Объект.ПутьКRAC) Тогда
	//	Объект.ПутьКRAC = КаталогПрограммы()+"rac.exe";	
	//КонецЕсли;   
	
	//ОформитьРегЗадание();
	
КонецПроцедуры


&НаСервере
Процедура ОформитьРегЗадание()
		
	РеглЗадание = "не указано";
	Если ЗначениеЗаполнено(Объект.РеглЗаданияИдентификатор) и НастройкиРЗ = Неопределено Тогда
		РЗ = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Объект.РеглЗаданияИдентификатор);
		РеглЗадание = РЗ.Расписание;
		НастройкиРЗ = РЗ.Расписание;
	ИначеЕсли НастройкиРЗ<>Неопределено Тогда
		РеглЗадание = ""+НастройкиРЗ;					
	КонецЕсли;
	
	
КонецПроцедуры
    
&НаКлиенте
Процедура РасписаниеРегЗаданияНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;
	
	Если ТипЗнч(НастройкиРЗ) <> Тип("РасписаниеРегламентногоЗадания") Тогда
		НастройкиРЗ = Новый РасписаниеРегламентногоЗадания;
	КонецЕсли;
	
	Обработчик = Новый ОписаниеОповещения("ИзменитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	РедактированиеРасписания = Новый ДиалогРасписанияРегламентногоЗадания(НастройкиРЗ);
	РедактированиеРасписания.Показать(Обработчик);

	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьРегламентноеЗаданиеЗавершение(Расписание, ДополнительныеПараметры) Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиРЗ = Расписание;
	СостояниеРЗ = Строка(Расписание);
	
	ОформитьРегЗадание();
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СтрокаПодключенияБазыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;  
	ЗаполнитьСтрокуПодключения();
	
КонецПроцедуры    

&НаКлиенте
Процедура ИмяСервераПриИзменении(Элемент)
	ЗаполнитьСтрокуПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ИмяБазыПриИзменении(Элемент)
	ЗаполнитьСтрокуПодключения();
КонецПроцедуры

&НаКлиенте
Процедура ПортКластераПриИзменении(Элемент)
	ЗаполнитьСтрокуПодключения();
КонецПроцедуры



&НаСервере
Процедура ЗаполнитьСтрокуПодключения()

	мПортКластера = ?(ЗначениеЗаполнено(Объект.ПортКластера),Объект.ПортКластера,1541);
	Объект.СтрокаПодключенияБазы = СтрШаблон("/S %1:%2\%3",Объект.ИмяСервера,формат(мПортКластера,"ЧГ=0"),Объект.ИмяБазы);	
	
КонецПроцедуры

&НаСервере
Процедура ТекущийСкриптНаСервере(мСкриптСсылка)
	
	//1) сформировать скрипт
	СтруктураПеременных = новый Структура("ИБ,Ошибка",Объект.Ссылка,"");
	мТекстСкрипта = Справочники.ЗД_Скрипты.СформироватьСкрипт(мСкриптСсылка,СтруктураПеременных);
	
	Если ПустаяСтрока(СтруктураПеременных.Ошибка) Тогда
		Сообщить("-------------------------------------");
		Сообщить(мТекстСкрипта);
		Сообщить("-------------------------------------"); 
	Иначе
		Сообщить("ошибка: "+СтруктураПеременных.Ошибка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСкрипт(Команда)
	
	ТекДанные = Элементы.Сценарий.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка",Объект.Ссылка,"Объект.Сценарий", Ложь);
		Возврат;	
	КонецЕсли;
	
	ТекущийСкриптНаСервере(ТекДанные.Скрипт);
	
КонецПроцедуры

&НаСервере
Процедура ТекущийСкриптЗапуск_СерверНаСервере(мСкриптСсылка)
	
	ЗД_Модуль_oscript_Привелегированный.ЗапуститьСкрипт(мСкриптСсылка,Объект.Ссылка)
	
КонецПроцедуры

&НаКлиенте
Процедура ТекущийСкриптЗапуск_Сервер(Команда)
	
	ТекДанные = Элементы.Сценарий.ТекущиеДанные;
	Если ТекДанные = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка",Объект.Ссылка,"Объект.Сценарий", Ложь);
		Возврат;	
	КонецЕсли;

	ТекущийСкриптЗапуск_СерверНаСервере(ТекДанные.Скрипт);
	
КонецПроцедуры



Процедура УстановитьОтметку(ЗначениеОтметки)

	Для Каждого ТекСтрока из Объект.Сценарий Цикл
		текСтрока.Отметка = ЗначениеОтметки;
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ОтметкаВсе(Команда)
	
	УстановитьОтметку(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтметкаСнятьВсе(Команда)
	
	УстановитьОтметку(Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ТекущийОбъект.ДополнительныеСвойства.Вставить("НастройкиРЗ", НастройкиРЗ);
КонецПроцедуры
